def удалить_пустые_папки(структура):
    индекс = 0
    while индекс < len(структура):
        строка = структура[индекс]
        if строка.startswith('+'):
            подпапка_найдена = False
            индекс_подпапки = индекс + 1

            while индекс_подпапки < len(структура) and структура[индекс_подпапки].startswith('+'):
                индекс_подпапки += 1

            while индекс_подпапки < len(структура) and not структура[индекс_подпапки].startswith('+'):
                if структура[индекс_подпапки].count('+') == строка.count('+') and структура[индекс_подпапки].count('-') > 0:
                    подпапка_найдена = True
                    break
                индекс_подпапки += 1

            if not подпапка_найдена:
                # Удаление пустой папки и связанных с ней файлов
                del структура[индекс:индекс_подпапки]
                индекс -= 1  # Возврат к предыдущему индексу после удаления
        индекс += 1
        print(структура)

# Пример использования:
структура = [
    '+',
    '++',
    '+++',
    '++++',
    '----',
    '----',
    '++++',
    '++++',
    '----',
    '+++',
    '++++',
    '----',
    '----',
    '++',
    '+++',
    '++++',
    '----',
    '----',
    '++',
    '--',
    '++',
    '+'
]

удалить_пустые_папки(структура)
print(структура)